app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
      @articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "corona"], ["text", "corona virus"], ["created_at", "2020-04-25 15:47:17.695678"], ["updated_at", "2020-04-25 15:47:17.695678"]]
---
    def create
      @article = Article.new(article_params)

      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "hhhhhhhh"], ["updated_at", "2020-04-25 15:47:41.836661"], ["id", 5]]
---
    def update
      @article = Article.find(params[:id])

      if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
    def destroy
      @article = Article.find(params[:id])
      @article.destroy