app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.create(params.require(:user).permit(:username,
    :password))